app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "こんちゃ"], ["created_at", "2022-02-28 09:46:14.720521"], ["updated_at", "2022-02-28 09:46:14.720521"]]
---
  def create
    @post = Post.new(
      content: params[:content],
      # user_id: @current_user.id
      )
    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "こんにちはみなさん"], ["updated_at", "2022-02-28 07:33:47.847621"], ["id", 6]]
---
  def update
    @post = Post.find_by(id: params[:id])
    @post.content = params[:content]
    if @post.save