app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password") VALUES (?, ?, ?, ?, ?)  [["name", "takeru"], ["email", "honma"], ["created_at", "2022-03-01 07:54:07.926019"], ["updated_at", "2022-03-01 07:54:07.926019"], ["password", "[FILTERED]"]]
---
  def create
    @user = User.new(name: params[:name], email: params[:email], password: params[:password])
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password" = ? LIMIT ?  [["email", ""], ["password", "[FILTERED]"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by(email: params[:email], password: params[:password])